jaysalomon/LOOM/firmware/esp32/loom_esp32_demo/esp32_loom_arduino.cpp
void Esp32Loom::record_experience(uint8_t* activated_nodes, uint8_t count,
                                 uint8_t* sensory_data, int8_t valence) {
    ArduinoExperience* exp = &topology->experience_buffer[topology->experience_index];

    exp->timestamp = millis();
    exp->emotional_valence = valence;
    exp->prediction_error = 0;  // TODO: compute

    memcpy(exp->activated_nodes, activated_nodes, min(count, (uint8_t)4));
    memcpy(exp->sensory_input, sensory_data, 2);

    topology->experience_index = (topology->experience_index + 1) % ARDUINO_EXPERIENCE_BUFFER;
}

// ============================================================================
// Hormonal System
// ============================================================================

void Esp32Loom::update_hormones() {
    read_sensors();

    ArduinoHormonalContext* h = &topology->hormones;

    h->curiosity = constrain(0.8f * (1.0f - h->stress) * (0.5f + h->light_level), 0.0f, 1.0f);
    h->stress = constrain(h->stress * 0.95f + (1.0f - h->battery_level) * 0.05f, 0.0f, 1.0f);
    h->satisfaction = constrain(0.5f + (h->touch_sensitivity - 0.5f) * 0.5f, 0.0f, 1.0f);
}

void Esp32Loom::apply_hormonal_modulation() {
    ArduinoHormonalContext* h = &topology->hormones;
    float effective_rate = 0.01f * (0.5f + h->curiosity * 0.5f) * (1.0f - h->stress * 0.3f);

    for (uint8_t i = 0; i < topology->num_nodes; i++) {
        ArduinoNodeVector* node = &topology->nodes[i];

        if (h->stress > 0.5f) {
            for (uint8_t j = VEC_EMOTIONAL; j < VEC_EMOTIONAL + 2; j++) {
                node->components[j] *= (1.0f + h->stress * 0.2f);
            }
        }
    }
}

// ============================================================================
// Main Processing
// ============================================================================

void Esp32Loom::kernel_cycle() {
    if (!initialized) return;

    static uint32_t last_cycle = 0;
    uint32_t now = millis();

    if (now - last_cycle < 10) return;  // Limit to ~100Hz
    last_cycle = now;

    update_hormones();
    apply_hormonal_modulation();

    // Process hyperedges
    for (uint8_t h = 0; h < topology->num_hyperedges; h++) {
        // Simplified hyperedge processing
        ArduinoHyperedge* hedge = &topology->hyperedges[h];
        float activation_sum = 0.0f;

        for (uint8_t i = 0; i < hedge->num_participants; i++) {
            activation_sum += topology->nodes[hedge->participants[i]].components[VEC_ACTIVATION];
        }

        hedge->processor_state = activation_sum / hedge->num_participants;
    }

    compute_activation_dynamics();
    hebbian_update();

    topology->cycles_executed++;
    topology->emergence_metric = compute_emergence();

    // OLED visualization
    static uint32_t last_oled = 0;
    if (topology->oled_enabled && now - last_oled > (1000 / topology->oled_update_rate)) {
        visualize_topology();
        last_oled = now;
    }

    // RGB LED visualization
    static uint32_t last_rgb = 0;
    if (topology->rgb_led_enabled && now - last_rgb > 50) {  // 20Hz RGB updates
        update_rgb_led();
        last_rgb = now;
    }
}

void Esp32Loom::run() {
    Serial.println("Starting ESP32 LOOM main loop...");

    while (true) {
        kernel_cycle();

        // Sleep consolidation every 1000 cycles
        if (topology->cycles_executed % 1000 == 0) {
            sleep_consolidation();
        }
    }
}

// ============================================================================
// Sensors and Inputs
// ============================================================================

void Esp32Loom::read_sensors() {
    // Simulated sensors for Arduino demo
    topology->hormones.light_level = (float)random(30, 90) / 100.0f;
    topology->hormones.temperature = (float)random(200, 350) / 10.0f;  // 20-35C
    topology->hormones.touch_sensitivity = (float)random(0, 100) / 100.0f;
}

void Esp32Loom::sensor_input(const char* sensor_name, float value) {
    // Update hormones based on sensor
    if (strcmp(sensor_name, "light") == 0) topology->hormones.light_level = value;
    else if (strcmp(sensor_name, "temperature") == 0) topology->hormones.temperature = value * 40.0f;
    else if (strcmp(sensor_name, "motion") == 0) topology->nodes[0].components[VEC_ACTIVATION] = value;
    else if (strcmp(sensor_name, "touch") == 0) topology->hormones.touch_sensitivity = value;

    // Record experience (simplified)
    uint8_t activated[4] = {0, 1, 2, 3};
    uint8_t sensory[2] = {(uint8_t)(value * 255), 0};
    record_experience(activated, 4, sensory, (int8_t)(value * 127));
}

// ============================================================================
// OLED Visualization
// ============================================================================

void Esp32Loom::enable_oled_visualization() {
    if (topology->oled_enabled) return;

    topology->oled_display = new Adafruit_SSD1306(OLED_WIDTH, OLED_HEIGHT, &Wire, OLED_RESET);
    if (!topology->oled_display->begin(SSD1306_SWITCHCAPVCC, OLED_I2C_ADDRESS)) {
        Serial.println("SSD1306 allocation failed");
        delete topology->oled_display;
        topology->oled_display = NULL;
        return;
    }

    topology->oled_enabled = true;
    topology->oled_display->clearDisplay();
    topology->oled_display->setTextSize(1);
    topology->oled_display->setTextColor(SSD1306_WHITE);
    topology->oled_display->setCursor(0, 0);
    topology->oled_display->println("LOOM Visualization");
    topology->oled_display->display();
}

void Esp32Loom::visualize_topology() {
    if (!topology->oled_enabled || !topology->oled_display) return;

    Adafruit_SSD1306* display = topology->oled_display;
    display->clearDisplay();

    // Draw simple network visualization
    for (uint8_t i = 0; i < min((uint8_t)20, topology->num_nodes); i++) {
        int x = (i % 10) * 12 + 6;
        int y = (i / 10) * 24 + 16;
        int radius = (int)(2 + topology->nodes[i].components[VEC_ACTIVATION] * 4);
        display->drawCircle(x, y, radius, SSD1306_WHITE);
    }

    // Stats
    display->setCursor(0, 54);
    display->printf("N:%d E:%d H:%d EMG:%.2f", topology->num_nodes, topology->num_edges,
                    topology->num_hyperedges, topology->emergence_metric);
    display->display();
}

void Esp32Loom::display_stats() {
    Serial.printf("Cycles: %d, Nodes: %d, Edges: %d, Hyperedges: %d, Emergence: %.3f\n",
                  topology->cycles_executed, topology->num_nodes, topology->num_edges,
                  topology->num_hyperedges, topology->emergence_metric);
}

// ============================================================================
// RGB LED Visualization
// ============================================================================

void Esp32Loom::enable_rgb_led() {
    #if LOOM_RGB_NEOPIXEL
      if (!topology->neopixel) {
        topology->neopixel = new Adafruit_NeoPixel(NEOPIXEL_NUM_LEDS, NEOPIXEL_PIN, NEO_GRB + NEO_KHZ800);
        topology->neopixel->begin();
        topology->neopixel->clear();
        topology->neopixel->setBrightness(64);
        topology->neopixel->show();
      }
    #else
      // Configure RGB LED pins
      pinMode(RGB_LED_RED_PIN, OUTPUT);
      pinMode(RGB_LED_GREEN_PIN, OUTPUT);
      pinMode(RGB_LED_BLUE_PIN, OUTPUT);

      // Initialize to off
      #if RGB_LED_COMMON_ANODE
        // Common anode: off = HIGH
        digitalWrite(RGB_LED_RED_PIN, HIGH);
        digitalWrite(RGB_LED_GREEN_PIN, HIGH);
        digitalWrite(RGB_LED_BLUE_PIN, HIGH);
      #else
        // Common cathode: off = LOW
        digitalWrite(RGB_LED_RED_PIN, LOW);
        digitalWrite(RGB_LED_GREEN_PIN, LOW);
        digitalWrite(RGB_LED_BLUE_PIN, LOW);
      #endif
    #endif

    topology->rgb_led_enabled = true;
    topology->rgb_red_value = 0;
    topology->rgb_green_value = 0;
    topology->rgb_blue_value = 0;
    topology->rgb_led_mode = 0;  // Off
    topology->rgb_last_update = millis();

