jaysalomon/LOOM/firmware/esp32/loom_esp32_demo/esp32_loom_arduino.cpp
    Serial.println("RGB LED visualization enabled!");
}

void Esp32Loom::disable_rgb_led() {
    if (topology->rgb_led_enabled) {
        // Turn off LED using the appropriate backend
        // Keep enabled true while switching off, then mark disabled
        set_rgb_color(0, 0, 0);

        #if LOOM_RGB_NEOPIXEL
          if (topology->neopixel) {
            topology->neopixel->clear();
            topology->neopixel->show();
          }
        #else
          // Pins were configured in enable_rgb_led
          // Nothing else needed since set_rgb_color already set them off
        #endif

        topology->rgb_led_enabled = false;
        topology->rgb_led_mode = 0;
    }
}

void Esp32Loom::set_rgb_color(uint8_t red, uint8_t green, uint8_t blue) {
    if (!topology->rgb_led_enabled) return;

    // Cache values
    topology->rgb_red_value = red;
    topology->rgb_green_value = green;
    topology->rgb_blue_value = blue;

    // Apply to hardware
    #if LOOM_RGB_NEOPIXEL
      if (topology->neopixel) {
        topology->neopixel->setPixelColor(0, red, green, blue);
        topology->neopixel->show();
      }
    #else
      // Discrete LED: respect polarity via helper
      rgbWrite(RGB_LED_RED_PIN, red);
      rgbWrite(RGB_LED_GREEN_PIN, green);
      rgbWrite(RGB_LED_BLUE_PIN, blue);
    #endif
}

void Esp32Loom::set_rgb_mode(uint8_t mode) {
    if (!topology->rgb_led_enabled) return;

    topology->rgb_led_mode = mode;

    if (mode == 0) {
        // Off
        set_rgb_color(0, 0, 0);
    }
}

void Esp32Loom::update_rgb_led() {
    if (!topology->rgb_led_enabled || topology->rgb_led_mode == 0) return;

    unsigned long now = millis();

    switch (topology->rgb_led_mode) {
        case 1:  // Static color based on emotional state
            rgb_visualize_emotion();
            break;

        case 2:  // Pulse based on activation
            rgb_visualize_activation();
            break;

        case 3:  // Rainbow based on learning progress
            rgb_visualize_learning();
            break;

        default:
            break;
    }

    topology->rgb_last_update = now;
}

void Esp32Loom::rgb_visualize_emotion() {
    // Calculate average emotional state
    float positive_emotion = 0.0f;
    float negative_emotion = 0.0f;
    uint8_t emotional_nodes = 0;

    for (uint8_t i = 0; i < topology->num_nodes; i++) {
        float emotion_val = topology->nodes[i].components[VEC_EMOTIONAL];
        if (emotion_val > 0.1f || emotion_val < -0.1f) {
            if (emotion_val > 0) positive_emotion += emotion_val;
            else negative_emotion += abs(emotion_val);
            emotional_nodes++;
        }
    }

    if (emotional_nodes > 0) {
        positive_emotion /= emotional_nodes;
        negative_emotion /= emotional_nodes;
    }

    // Map to RGB: Green for positive, Red for negative, Blue for neutral
    uint8_t red = (uint8_t)(negative_emotion * 255.0f);
    uint8_t green = (uint8_t)(positive_emotion * 255.0f);
    uint8_t blue = (uint8_t)((1.0f - positive_emotion - negative_emotion) * 255.0f);

    set_rgb_color(red, green, blue);
}

void Esp32Loom::rgb_visualize_activation() {
    // Calculate overall activation level
    float total_activation = 0.0f;
    for (uint8_t i = 0; i < topology->num_nodes; i++) {
        total_activation += topology->nodes[i].components[VEC_ACTIVATION];
    }

    float avg_activation = total_activation / topology->num_nodes;

    // Pulse effect based on activation
    static float pulse_phase = 0.0f;
    pulse_phase += 0.1f;
    if (pulse_phase > 2 * M_PI) pulse_phase = 0.0f;

    float pulse_intensity = (sin(pulse_phase) + 1.0f) * 0.5f;  // 0-1
    uint8_t intensity = (uint8_t)(avg_activation * pulse_intensity * 255.0f);

    // White pulsing for activation
    set_rgb_color(intensity, intensity, intensity);
}

void Esp32Loom::rgb_visualize_learning() {
    // Rainbow effect based on learning progress
    static float rainbow_phase = 0.0f;
    rainbow_phase += 0.05f;
    if (rainbow_phase > 2 * M_PI) rainbow_phase = 0.0f;

    // Learning progress affects brightness
    float learning_progress = (float)topology->cycles_executed / 10000.0f;  // Scale over 10k cycles
    learning_progress = constrain(learning_progress, 0.0f, 1.0f);

    uint8_t brightness = (uint8_t)(learning_progress * 255.0f);

    // HSV to RGB conversion for rainbow
    float hue = rainbow_phase / (2 * M_PI);  // 0-1
    uint8_t red, green, blue;

    if (hue < 0.333f) {
        red = 255;
        green = (uint8_t)(hue * 3 * 255);
        blue = 0;
    } else if (hue < 0.666f) {
        red = (uint8_t)((0.666f - hue) * 3 * 255);
        green = 255;
        blue = 0;
    } else {
        red = 0;
        green = (uint8_t)((1.0f - hue) * 3 * 255);
        blue = 255;
    }

    // Apply brightness
    red = (uint8_t)((float)red * learning_progress);
    green = (uint8_t)((float)green * learning_progress);
    blue = (uint8_t)((float)blue * learning_progress);

    set_rgb_color(red, green, blue);
}

// ============================================================================
// Utility and Math
// ============================================================================

void Esp32Loom::print_topology_stats() {
    Serial.printf("Nodes: %d, Edges: %d, Hyperedges: %d\n",
                  topology->num_nodes, topology->num_edges, topology->num_hyperedges);
}

uint16_t Esp32Loom::get_hash_string(const char* str) {
    uint16_t hash = 0;
    while (*str) {
        hash = (hash * 31) + *str++;
    }
    return hash;
}

float Esp32Loom::cosine_similarity(const ArduinoNodeVector* a, const ArduinoNodeVector* b) {
    float dot = 0.0f;
    float mag_a = 0.0f;
    float mag_b = 0.0f;

    for (uint8_t i = 0; i < ARDUINO_NODE_DIMENSIONS; i++) {
        dot += a->components[i] * b->components[i];
        mag_a += a->components[i] * a->components[i];
        mag_b += b->components[i] * b->components[i];
    }

    if (mag_a == 0 || mag_b == 0) return 0.0f;
    return dot / (sqrt(mag_a) * sqrt(mag_b));
}

void Esp32Loom::dump_node(uint8_t node_id) {
    if (node_id >= topology->num_nodes) return;

    Serial.printf("Node %d:\n", node_id);
    for (uint8_t i = 0; i < ARDUINO_NODE_DIMENSIONS; i++) {
        Serial.printf("%.3f ", topology->nodes[node_id].components[i]);
    }
    Serial.println();
}

// ============================================================================
// Internal Helpers
// ============================================================================

