jaysalomon/LOOM/firmware/esp32/loom_esp32_demo/esp32_loom_arduino.cpp
void Esp32Loom::initialize_vector(ArduinoNodeVector* vector, uint16_t hash) {
    for (uint8_t i = 0; i < ARDUINO_NODE_DIMENSIONS; i++) {
        vector->components[i] = ((float)((hash >> (i % 8)) & 0xFF) / 255.0f) * 0.2f;
    }

    // Identity baseline
    for (uint8_t i = VEC_IDENTITY; i < VEC_IDENTITY + 4; i++) {
        vector->components[i] = 0.5f;
    }

    // Semantic baseline
    for (uint8_t i = VEC_SEMANTIC; i < VEC_SEMANTIC + 8; i++) {
        vector->components[i] += 0.1f;
    }

    // Activation baseline
    vector->components[VEC_ACTIVATION] = 0.1f;
    vector->components[VEC_ACTIVATION + 1] = 0.0f; // Previous activation

    // Emotional baseline
    for (uint8_t i = VEC_EMOTIONAL; i < VEC_EMOTIONAL + 3; i++) {
        vector->components[i] = 0.0f;
    }
}

void Esp32Loom::normalize_vector(ArduinoNodeVector* vector) {
    float sum = 0.0f;
    for (uint8_t i = 0; i < ARDUINO_NODE_DIMENSIONS; i++) {
        sum += vector->components[i] * vector->components[i];
    }

    float mag = sqrt(sum);
    if (mag > 0.0f) {
        for (uint8_t i = 0; i < ARDUINO_NODE_DIMENSIONS; i++) {
            vector->components[i] /= mag;
        }
    }
}

void Esp32Loom::hebbian_update_pair(uint8_t node_a, uint8_t node_b, float rate) {
    // Simplified Hebbian adjustment: nudge semantic components closer
    ArduinoNodeVector* a = &topology->nodes[node_a];
    ArduinoNodeVector* b = &topology->nodes[node_b];

    for (uint8_t i = VEC_SEMANTIC; i < VEC_SEMANTIC + 8; i++) {
        float delta = (b->components[i] - a->components[i]) * rate;
        a->components[i] += delta;
        b->components[i] -= delta * 0.5f;  // Asymmetry
    }
}

void Esp32Loom::compute_activation_dynamics() {
    // Decay previous activation
    for (uint8_t i = 0; i < topology->num_nodes; i++) {
        float prev = topology->nodes[i].components[VEC_ACTIVATION];
        topology->nodes[i].components[VEC_ACTIVATION + 1] = prev;
        topology->nodes[i].components[VEC_ACTIVATION] *= 0.95f;
    }

    // Spread activation
    for (uint16_t e = 0; e < topology->num_edges; e++) {
        ArduinoEdge* edge = &topology->edges[e];
        uint8_t target = edge->target;
        float weight = (float)edge->weight / 127.0f;
        topology->nodes[target].components[VEC_ACTIVATION] += weight * 0.05f;
    }

    // Normalize activations
    for (uint8_t i = 0; i < topology->num_nodes; i++) {
        topology->nodes[i].components[VEC_ACTIVATION] = constrain(topology->nodes[i].components[VEC_ACTIVATION], 0.0f, 1.0f);
    }
}

void Esp32Loom::apply_trajectory_evolution() {
    // Placeholder for trajectory evolution logic
}

void Esp32Loom::sleep_consolidation() {
    Serial.println("Running sleep consolidation...");

    uint8_t edges_removed = 0;
    for (uint16_t i = 0; i < topology->num_edges; i++) {
        if (abs(topology->edges[i].weight) < 10) {
            topology->edges[i].flags |= EDGE_FLAG_TEMPORARY;
            edges_removed++;
        }
    }

    Serial.printf("Sleep consolidation: removed %d weak edges\n", edges_removed);
}

float Esp32Loom::compute_emergence() {
    float node_activity = 0.0f;
    float hyperedge_activity = 0.0f;

    for (uint8_t i = 0; i < topology->num_nodes; i++) {
        node_activity += topology->nodes[i].components[VEC_ACTIVATION];
    }

    for (uint8_t i = 0; i < topology->num_hyperedges; i++) {
        hyperedge_activity += topology->hyperedges[i].processor_state;
    }

    if (node_activity > 0.0f) {
        return hyperedge_activity / node_activity;
    }
    return 0.0f;
}
